# SquareCentimeters Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..SquareCentimeters Property
UnitTypeId Class See Also
---
Square centimeters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SquareCentimeters { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SquareCentimeters As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SquareCentimeters {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace